LightningFr0st/uni-hardware-archive/stm32/arduino-multishield/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define A1_BUTTON_Pin GPIO_PIN_1
#define A1_BUTTON_GPIO_Port GPIOA
#define A1_BUTTON_EXTI_IRQn EXTI1_IRQn
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define A2_BUTTON_Pin GPIO_PIN_4
#define A2_BUTTON_GPIO_Port GPIOA
#define A2_BUTTON_EXTI_IRQn EXTI4_IRQn
#define D1_led_Pin GPIO_PIN_5
#define D1_led_GPIO_Port GPIOA
#define D2_led_Pin GPIO_PIN_6
#define D2_led_GPIO_Port GPIOA
#define D3_led_Pin GPIO_PIN_7
#define D3_led_GPIO_Port GPIOA
#define A3_BUTTON_Pin GPIO_PIN_0
#define A3_BUTTON_GPIO_Port GPIOB
#define A3_BUTTON_EXTI_IRQn EXTI0_IRQn
#define CLK_Pin GPIO_PIN_8
#define CLK_GPIO_Port GPIOA
#define DATA_Pin GPIO_PIN_9
#define DATA_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define BUZZER_Pin GPIO_PIN_3
#define BUZZER_GPIO_Port GPIOB
#define LATCH_Pin GPIO_PIN_5
#define LATCH_GPIO_Port GPIOB
#define D4_led_Pin GPIO_PIN_6
#define D4_led_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
